# Квадратное уравнение
puts "Найдите корни и дискриминант квадратного уравнения "
puts "Введите первый коэффициент  "
a = gets.chomp

print "Введите второй коэффициент  "
b = gets.chomp

print "Введите третий коэфициент  "
c = gets.chomp

a = a.to_i
b = b.to_i
c = c.to_i
d = (b**2 - 4*a*c)
if d >0
  puts "Дискриминант равен #{Math.sqrt(d) } "
  puts "Первый корень равен #{(-b + Math.sqrt(d))/(2*a)}"
  puts "Второй корень равен #{(-b - Math.sqrt(d))/(2*a)}"
elsif d == 0
  puts "Дискриминант равен 0 "
  puts "Первый и второй  корень равены #{-b/(2*a)}"

else 
  puts "Корней нет"
end


